; domain
;; logistics domain Typed version.
;;

(define (domain logistics)
  (:requirements :strips :typing) 
  (:types truck
          semi
          airplane - vehicle
          package
          vehicle - physobj
          airport
          depot
          location - place
          city
          place 
          physobj - object)
  
  (:predicates 	(in-city ?loc - place ?city - city)
		(at ?obj - physobj ?loc - place)
		(in ?pkg - package ?veh - vehicle)
    (highway ?d1 ?d2 - depot))
  
(:action LOAD-TRUCK
   :parameters    (?pkg - package ?truck - truck ?loc - place)
   :precondition  (and (at ?truck ?loc) (at ?pkg ?loc))
   :effect        (and (not (at ?pkg ?loc)) (in ?pkg ?truck)))

(:action LOAD-AIRPLANE
  :parameters   (?pkg - package ?airplane - airplane ?loc - place)
  :precondition (and (at ?pkg ?loc) (at ?airplane ?loc))
  :effect       (and (not (at ?pkg ?loc)) (in ?pkg ?airplane)))

(:action UNLOAD-TRUCK
  :parameters   (?pkg - package ?truck - truck ?loc - place)
  :precondition (and (at ?truck ?loc) (in ?pkg ?truck))
  :effect       (and (not (in ?pkg ?truck)) (at ?pkg ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters    (?pkg - package ?airplane - airplane ?loc - place)
  :precondition  (and (in ?pkg ?airplane) (at ?airplane ?loc))
  :effect        (and (not (in ?pkg ?airplane)) (at ?pkg ?loc)))

(:action DRIVE-TRUCK
  :parameters (?truck - truck ?loc-from - place ?loc-to - place ?city - city)
  :precondition
   (and (at ?truck ?loc-from) (in-city ?loc-from ?city) (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

; ADDED DRIVE-SEMI
(:action DRIVE-SEMI
  :parameters (?semi - semi ?dep-from ?dep-to - depot)
  :precondition (and (at ?semi ?dep-from) (highway ?dep-from ?dep-to))
  :effect (and (not (at ?semi ?dep-from)) (at ?semi ?dep-to)))

; ADDED LOAD-SEMI
(:action LOAD-SEMI
  :parameters (?semi - semi ?dep - depot ?pkg - package)
  :precondition (and (at ?semi ?dep) (at ?pkg ?dep))
  :effect (and (not (at ?pkg ?dep)) (in ?pkg ?semi))
)

; ADDED UNLOAD-SEMI
(:action UNLOAD-SEMI
  :parameters (?semi - semi ?dep - depot ?pkg - package)
  :precondition (and (at ?semi ?dep) (in ?pkg ?semi))
  :effect (and (not (in ?pkg ?semi)) (at ?pkg ?dep)))

(:action FLY-AIRPLANE
  :parameters (?airplane - airplane ?loc-from - airport ?loc-to - airport)
  :precondition
   (at ?airplane ?loc-from)
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-10-0)
(:domain logistics)
(:objects
  apn1 apn2 apn3 apn4 - airplane
  smi1 smi2 smi3 smi4 - semi
  dep1 dep2 dep3 dep4 - depot
  apt1 apt4 apt3 apt2 - airport
  pos4 pos3  pos2  pos1 - location
  cit4 cit3 cit2 cit1 - city 
  tru4 tru3 tru2 tru1 - truck 
  obj43 obj42 obj41 obj33 obj32 obj31 obj23 obj22 obj21 obj13 obj12 obj11 - package)

(:init 
 (at tru1 pos1)
 (at obj11 pos1) (at obj12 pos1) (at obj13 pos1) (at tru2 pos2) (at obj21 pos2)
 (at obj22 pos2) (at obj23 pos2) (at tru3 pos3) (at obj31 pos3) (at obj32 pos3)
 (at obj33 pos3) (at tru4 pos4) (at obj41 pos4) (at obj42 pos4) (at obj43 pos4)
 (in-city pos1 cit1) (in-city apt1 cit1) (in-city pos2 cit2) (in-city apt2 cit2)
 (in-city pos3 cit3) (in-city apt3 cit3) (in-city pos4 cit4) (in-city apt4 cit4)

; HIGHWAYS 
 (highway dep1 dep2) (highway dep2 dep1)
 (highway dep1 dep3) (highway dep3 dep1)
 (highway dep3 dep4) (highway dep4 dep3)

; (highway dep2 dep3) (highway dep3 dep2)
; (highway dep2 dep4) (highway dep4 dep2)
; (highway dep1 dep4) (highway dep4 dep1)

; AIRPLANES
 (at apn1 apt1)
; (at apn2 apt2)
; (at apn3 apt3)
; (at apn4 apt4)

; SEMI'S
 (at smi1 dep1)
 (at smi2 dep2)
 (at smi3 dep3)
 (at smi4 dep4) 

; DEPOTS 
 (in-city dep1 cit1)
 (in-city dep2 cit2)
 (in-city dep3 cit3)
 (in-city dep4 cit4)
)

(:goal (and (at obj31 pos3) (at obj33 apt3) (at obj41 apt3) (at obj23 pos4)
            (at obj11 pos3) (at obj22 apt2) (at obj12 apt1) (at obj21 pos4)
            (at obj42 pos4) (at obj32 pos1)))
)

; plan
1. (load-truck obj22 tru2 pos2)
   deleted: (at obj22 pos2)
   added: (in obj22 tru2)
   goals met: 2 of 10
2. (load-truck obj41 tru4 pos4)
   deleted: (at obj41 pos4)
   added: (in obj41 tru4)
   goals met: 2 of 10
3. (load-truck obj32 tru3 pos3)
   deleted: (at obj32 pos3)
   added: (in obj32 tru3)
   goals met: 2 of 10
4. (load-truck obj12 tru1 pos1)
   deleted: (at obj12 pos1)
   added: (in obj12 tru1)
   goals met: 2 of 10
5. (load-truck obj33 tru3 pos3)
   deleted: (at obj33 pos3)
   added: (in obj33 tru3)
   goals met: 2 of 10
6. (load-truck obj21 tru2 pos2)
   deleted: (at obj21 pos2)
   added: (in obj21 tru2)
   goals met: 2 of 10
7. (load-truck obj23 tru2 pos2)
   deleted: (at obj23 pos2)
   added: (in obj23 tru2)
   goals met: 2 of 10
8. (load-truck obj11 tru1 pos1)
   deleted: (at obj11 pos1)
   added: (in obj11 tru1)
   goals met: 2 of 10
9. (drive-truck tru2 pos2 apt2 cit2)
   deleted: (at tru2 pos2)
   added: (at tru2 apt2)
   goals met: 2 of 10
10. (unload-truck obj22 tru2 apt2)
   deleted: (in obj22 tru2)
   added: (at obj22 apt2)
   goals met: 3 of 10
11. (unload-truck obj21 tru2 apt2)
   deleted: (in obj21 tru2)
   added: (at obj21 apt2)
   goals met: 3 of 10
12. (unload-truck obj23 tru2 apt2)
   deleted: (in obj23 tru2)
   added: (at obj23 apt2)
   goals met: 3 of 10
13. (drive-truck tru4 pos4 apt4 cit4)
   deleted: (at tru4 pos4)
   added: (at tru4 apt4)
   goals met: 3 of 10
14. (unload-truck obj41 tru4 apt4)
   deleted: (in obj41 tru4)
   added: (at obj41 apt4)
   goals met: 3 of 10
15. (drive-truck tru3 pos3 apt3 cit3)
   deleted: (at tru3 pos3)
   added: (at tru3 apt3)
   goals met: 3 of 10
16. (unload-truck obj32 tru3 apt3)
   deleted: (in obj32 tru3)
   added: (at obj32 apt3)
   goals met: 3 of 10
17. (unload-truck obj33 tru3 apt3)
   deleted: (in obj33 tru3)
   added: (at obj33 apt3)
   goals met: 4 of 10
18. (drive-truck tru1 pos1 apt1 cit1)
   deleted: (at tru1 pos1)
   added: (at tru1 apt1)
   goals met: 4 of 10
19. (unload-truck obj12 tru1 apt1)
   deleted: (in obj12 tru1)
   added: (at obj12 apt1)
   goals met: 5 of 10
20. (unload-truck obj11 tru1 apt1)
   deleted: (in obj11 tru1)
   added: (at obj11 apt1)
   goals met: 5 of 10
21. (load-airplane obj11 apn1 apt1)
   deleted: (at obj11 apt1)
   added: (in obj11 apn1)
   goals met: 5 of 10
22. (fly-airplane apn1 apt1 apt4)
   deleted: (at apn1 apt1)
   added: (at apn1 apt4)
   goals met: 5 of 10
23. (load-airplane obj41 apn1 apt4)
   deleted: (at obj41 apt4)
   added: (in obj41 apn1)
   goals met: 5 of 10
24. (fly-airplane apn1 apt4 apt2)
   deleted: (at apn1 apt4)
   added: (at apn1 apt2)
   goals met: 5 of 10
25. (load-airplane obj21 apn1 apt2)
   deleted: (at obj21 apt2)
   added: (in obj21 apn1)
   goals met: 5 of 10
26. (load-airplane obj23 apn1 apt2)
   deleted: (at obj23 apt2)
   added: (in obj23 apn1)
   goals met: 5 of 10
27. (fly-airplane apn1 apt2 apt4)
   deleted: (at apn1 apt2)
   added: (at apn1 apt4)
   goals met: 5 of 10
28. (unload-airplane obj21 apn1 apt4)
   deleted: (in obj21 apn1)
   added: (at obj21 apt4)
   goals met: 5 of 10
29. (load-truck obj21 tru4 apt4)
   deleted: (at obj21 apt4)
   added: (in obj21 tru4)
   goals met: 5 of 10
30. (unload-airplane obj23 apn1 apt4)
   deleted: (in obj23 apn1)
   added: (at obj23 apt4)
   goals met: 5 of 10
31. (load-truck obj23 tru4 apt4)
   deleted: (at obj23 apt4)
   added: (in obj23 tru4)
   goals met: 5 of 10
32. (drive-truck tru4 apt4 pos4 cit4)
   deleted: (at tru4 apt4)
   added: (at tru4 pos4)
   goals met: 5 of 10
33. (unload-truck obj21 tru4 pos4)
   deleted: (in obj21 tru4)
   added: (at obj21 pos4)
   goals met: 6 of 10
34. (unload-truck obj23 tru4 pos4)
   deleted: (in obj23 tru4)
   added: (at obj23 pos4)
   goals met: 7 of 10
35. (fly-airplane apn1 apt4 apt3)
   deleted: (at apn1 apt4)
   added: (at apn1 apt3)
   goals met: 7 of 10
36. (load-airplane obj32 apn1 apt3)
   deleted: (at obj32 apt3)
   added: (in obj32 apn1)
   goals met: 7 of 10
37. (unload-airplane obj41 apn1 apt3)
   deleted: (in obj41 apn1)
   added: (at obj41 apt3)
   goals met: 8 of 10
38. (unload-airplane obj11 apn1 apt3)
   deleted: (in obj11 apn1)
   added: (at obj11 apt3)
   goals met: 8 of 10
39. (load-truck obj11 tru3 apt3)
   deleted: (at obj11 apt3)
   added: (in obj11 tru3)
   goals met: 8 of 10
40. (drive-truck tru3 apt3 pos3 cit3)
   deleted: (at tru3 apt3)
   added: (at tru3 pos3)
   goals met: 8 of 10
41. (unload-truck obj11 tru3 pos3)
   deleted: (in obj11 tru3)
   added: (at obj11 pos3)
   goals met: 9 of 10
42. (fly-airplane apn1 apt3 apt1)
   deleted: (at apn1 apt3)
   added: (at apn1 apt1)
   goals met: 9 of 10
43. (unload-airplane obj32 apn1 apt1)
   deleted: (in obj32 apn1)
   added: (at obj32 apt1)
   goals met: 9 of 10
44. (load-truck obj32 tru1 apt1)
   deleted: (at obj32 apt1)
   added: (in obj32 tru1)
   goals met: 9 of 10
45. (drive-truck tru1 apt1 pos1 cit1)
   deleted: (at tru1 apt1)
   added: (at tru1 pos1)
   goals met: 9 of 10
46. (unload-truck obj32 tru1 pos1)
   deleted: (in obj32 tru1)
   added: (at obj32 pos1)
   goals met: 10 of 10
